#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("API_ОписаниеТовара").ВТранзакции()
			.ДобавитьТест("ПолучитьТоварПоАртикулу", "", "Позитив, Task-1") 
			.ДобавитьТест("ПолучитьТоварПоАртикулуНеНайден", "", "Негатив, Task-1")  
			.ДобавитьТест("ПолучитьТоварПоАртикулу_Корректный", "", "Позитив, Task-1") 
	;

КонецПроцедуры

Процедура ПолучитьТоварПоАртикулу() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Артикул = "Kol67";     
	
	// 2. Выполнение функции.
	Товар = API_ОписаниеТовара.ПолучитьТоварПоАртикулу(Артикул);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(Товар)
		.ИмеетТип("СправочникОбъект.Товары")  
		.Свойство("Артикул").Равно(Артикул)
		.Свойство("Наименование").Равно("Колбаса")
		;
		
КонецПроцедуры            
	
Процедура ПолучитьТоварПоАртикулуНеНайден() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Артикул = "Kol67125698523355";     
	
	// 2. Выполнение функции.
	Товар = API_ОписаниеТовара.ПолучитьТоварПоАртикулу(Артикул);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(Товар)           
		.ИмеетТип("Неопределено")  
		;
		
КонецПроцедуры    
	
Процедура ПолучитьТоварПоАртикулу_Корректный() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.
	Артикул = "Test1234";
	Наименование = "Test_Хлеб";  

	НовыйТовар = ЮТест.Данные().КонструкторОбъекта("Справочник.Товары")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", Наименование)
		.Установить("Артикул", Артикул)   
		.ФикцияРеквизитов("Поставщик, Вид, Штрихкод, Описание")
		.Записать();
	
	
	// 2. Выполнение функции.    
	Товар = API_ОписаниеТовара.ПолучитьТоварПоАртикулу(Артикул);
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(Товар)
		.ИмеетТип("СправочникОбъект.Товары")  
		.Свойство("Артикул").Равно(Артикул)
		.Свойство("Наименование").Равно(Наименование)
		;
		
КонецПроцедуры            

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти