
Функция СозданиеТовара(Наименование) Экспорт
	
	ТоварНовый = ЮТест.Данные().КонструкторОбъекта("Справочник.Товары")
		.ФикцияОбязательныхПолей() // Автоматически заполняем обязательные поля
		.Установить("Наименование", Наименование)
		.Установить("Вид", Перечисления.ВидыТоваров.Товар)   
		.Записать();  
		
	Возврат ТоварНовый;
		
КонецФункции 

Функция СозданиеДокументаПриходТовара(ЗначенияСтроки, Провести = Ложь) Экспорт 
	
	КонструкторДокумента = ЮТест.Данные().КонструкторОбъекта("Документы.ПриходТовара")   
		.ФикцияОбязательныхПолей() 
		.ФикцияРеквизитов("Поставщик, Склад, Валюта, Организация") 
		.Установить("Дата", ТекущаяДатаСеанса() - 120)
		.ТабличнаяЧасть("Товары") 
			.ДобавитьСтроку() 
			.УстановитьРеквизиты(ЗначенияСтроки)
		;
		
	Если Провести Тогда
		ПриходТовара = КонструкторДокумента.Провести();
	Иначе
		ПриходТовара = КонструкторДокумента.Записать();
	КонецЕсли;
	
	Возврат ПриходТовара;
		
КонецФункции 

Функция СозданиеДокументаРасходТовара(ЗначенияШапки, ЗначенияСтроки, Провести = Ложь) Экспорт
	
	КонструкторДокумента = ЮТест.Данные().КонструкторОбъекта("Документы.РасходТовара")   
		.ФикцияОбязательныхПолей()  
		.Установить("Дата", ТекущаяДатаСеанса())
		.УстановитьРеквизиты(ЗначенияШапки)
		.ФикцияРеквизитов("Покупатель, ВидЦен, ОбоснованиеОтгрузки") 
		.ТабличнаяЧасть("Товары")
			.ДобавитьСтроку() 
			.УстановитьРеквизиты(ЗначенияСтроки)
		;
		
	Если Провести Тогда
		РасходТовара = КонструкторДокумента.Провести();
	Иначе
		РасходТовара = КонструкторДокумента.Записать();
	КонецЕсли;
	
	Возврат РасходТовара;
		
КонецФункции   

