#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
 ЮТТесты
        .ДобавитьТест("СложениеБезПараметров")
		.ДобавитьТест("СложениеСПараметрами")
            .СПараметрами(2, 3, 5)
            .СПараметрами(2, -3, -1)
            .СПараметрами("2", "-3", "2-3")
            .СПараметрами("2", -3, "2-3")
    ;
КонецПроцедуры

Процедура СложениеБезПараметров() Экспорт   
	
	РезультатСложения = 2 + 2; 
	
    ЮТест.ОжидаетЧто(РезультатСложения)  
		.ИмеетТип("Число")
		.Равно(4);

	КонецПроцедуры
	
Процедура СложениеСПараметрами(ПервыйОперанд, ВторойОперанд, Результат) Экспорт

    РезультатСложения = ПервыйОперанд + ВторойОперанд;   
	
    ЮТест.ОжидаетЧто(РезультатСложения)
        .Заполнено()
        .ИмеетТип("Число, Строка")
        .Равно(Результат);

КонецПроцедуры

#КонецОбласти


