#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("Документ Расход товара").ВТранзакции()
			.ДобавитьТест("СозданиеДокументов", "", "Позитив, Task-2")   
			.ДобавитьТест("ДокументыПроведеныИСодержатДвижения", "", "Позитив, Task-2")   
			.ДобавитьТест("ДвиженияВыходятВНоль", "", "Позитив, Task-2") 
	;

КонецПроцедуры

Процедура СозданиеДокументов() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.  
	ТоварНовый = ГенерацияДанных.СозданиеТовара("Тест_Хлеб");
	
	ЗначенияСтроки = Новый Структура;    
	ЗначенияСтроки.Вставить("Товар", ТоварНовый);
	ЗначенияСтроки.Вставить("Цена", 10);
	ЗначенияСтроки.Вставить("Количество", 5);
	ЗначенияСтроки.Вставить("Сумма", 50);
	
	// 2. Выполнение функции.    
	
	// 3. Проверка результата.
	
	МассивДокументов = Новый Массив;
	
	Для Сч = 1 По 3 Цикл
		
		ПриходТовара = ГенерацияДанных.СозданиеДокументаПриходТовара(ЗначенияСтроки);
		
		ЮТест.ОжидаетЧто(ПриходТовара.Ссылка)
			.Заполнено()
			.ИмеетТип("ДокументСсылка.ПриходТовара");      
			
		МассивДокументов.Добавить(ПриходТовара);
	
		ЗначенияШапки = Новый Структура;    
		ЗначенияШапки.Вставить("Склад", ПриходТовара.Склад);
		ЗначенияШапки.Вставить("Валюта", ПриходТовара.Валюта);
		ЗначенияШапки.Вставить("Организация", ПриходТовара.Организация);
		
		РасходТовара = ГенерацияДанных.СозданиеДокументаРасходТовара(ЗначенияШапки, ЗначенияСтроки);
	
		ЮТест.ОжидаетЧто(РасходТовара.Ссылка)
			.Заполнено()
			.ИмеетТип("ДокументСсылка.РасходТовара");     
			
		МассивДокументов.Добавить(РасходТовара);
	
	КонецЦикла;  
	
	ЮТест.ОжидаетЧто(МассивДокументов.Количество())
		.Равно(6);
		
КонецПроцедуры            

Процедура ДокументыПроведеныИСодержатДвижения() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.  
	ТоварНовый = ГенерацияДанных.СозданиеТовара("Тест_Хлеб");
	
	ЗначенияСтроки = Новый Структура;    
	ЗначенияСтроки.Вставить("Товар", ТоварНовый);
	ЗначенияСтроки.Вставить("Цена", 10);
	ЗначенияСтроки.Вставить("Количество", 5);
	ЗначенияСтроки.Вставить("Сумма", 50);

	МассивДокументов = Новый Массив;    
	Для Сч = 1 По 3 Цикл
		
		ПриходТовара = ГенерацияДанных.СозданиеДокументаПриходТовара(ЗначенияСтроки);
		МассивДокументов.Добавить(ПриходТовара);
		
		ЗначенияШапки = Новый Структура;    
		ЗначенияШапки.Вставить("Склад", ПриходТовара.Склад);
		ЗначенияШапки.Вставить("Валюта", ПриходТовара.Валюта);
		ЗначенияШапки.Вставить("Организация", ПриходТовара.Организация);
		
		РасходТовара = ГенерацияДанных.СозданиеДокументаРасходТовара(ЗначенияШапки, ЗначенияСтроки);
		МассивДокументов.Добавить(РасходТовара);      
		
	КонецЦикла;  
		
	// 2. Выполнение функции.    
	
	// 3. Проверка результата.
	ЮТест.ОжидаетЧто(МассивДокументов.Количество())
		.Равно(6);
		
	Для Каждого Элемент Из МассивДокументов Цикл
		
		ЮТест.ОжидаетЧто(Элемент.ПолучитьОбъект())
			.Метод("Записать").Параметр(РежимЗаписиДокумента.Проведение)
			.НеВыбрасываетИсключение();
			
		ТоварныеЗапасы = ЮТЗапросы.ДвиженияДокумента(Элемент, "ТоварныеЗапасы");
		ЮТест.ОжидаетЧто(ТоварныеЗапасы.Количество()).БольшеИлиРавно(1);
	
	КонецЦикла;  
	
КонецПроцедуры                  
	
Процедура ДвиженияВыходятВНоль() Экспорт
	
	// 1. Подготовка параметров и генерация данных для выполнения функции.  
	ТоварНовый = ГенерацияДанных.СозданиеТовара("Тест_Хлеб");
	
	ЗначенияСтроки = Новый Структура;    
	ЗначенияСтроки.Вставить("Товар", ТоварНовый);
	ЗначенияСтроки.Вставить("Цена", 10);
	ЗначенияСтроки.Вставить("Количество", 5);
	ЗначенияСтроки.Вставить("Сумма", 50);

	Для Сч = 1 По 3 Цикл
		
		ПриходТовара = ГенерацияДанных.СозданиеДокументаПриходТовара(ЗначенияСтроки, Истина);
		
		ЗначенияШапки = Новый Структура;    
		ЗначенияШапки.Вставить("Склад", ПриходТовара.Склад);
		ЗначенияШапки.Вставить("Валюта", ПриходТовара.Валюта);
		ЗначенияШапки.Вставить("Организация", ПриходТовара.Организация);
		
		РасходТовара = ГенерацияДанных.СозданиеДокументаРасходТовара(ЗначенияШапки, ЗначенияСтроки, Истина);
		
	КонецЦикла;  
		
	// 2. Выполнение функции.    
	
	// 3. Проверка результата.
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.Условия.Добавить("КоличествоОстаток <> 0");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", ТоварНовый);
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("КоличествоОстаток");
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоИстина();
	
КонецПроцедуры                  
	


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти